package cn.itcast.notes;

/**
 * 正则表达式的匹配规则
 * x 代表的是字符x
 * \\ 代表的是反斜线字符\
 * \t 代表制表符
 * \n 换行符 多一个空行
 * \r 回车符 没有空行.光标跑道下行文本前
 * [abc] 字符类,代表的字符是abc
 * [^abc] 代表是除了abc以外的任意字符
 * [a-zA-z] 代表是a到z或A到Z两头的字母包括在内
 * [0-9] 代表是0-9数字
 * [a-zA-Z_0-9] 代表是字母或者数字或者下划线
 * . 代表的是任何字符
 * \d 代表是数字[0-9]
 * \D 代表的不是数字
 * \w 代表的数字或字母或下划线[0-9a-zaA-Z_]
 * ^ 边界匹配匹配器.代表的是行的开头
 * \b 代表的是单词边界.
 * X?  代表X出现一次或0次
 * X*  代表X出现人一次
 * X+  代表X至少出现一次
 * X{n} X正好出现n
 * X{n,} X至少出现n次
 * X{n,m} X次数出现在n-m次之间
 * 
 * @author JiaLian
 *
 */
public class day1 {

}
